[![Open In Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/HarisJafri-xcode/Data-Analyst-in-Python/blob/main/04_Data_Manipulation_with_pandas/03_Slicing_and_Indexing_DataFrames.ipynb)

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# Setting and Removing Indexes

pandas allows you to designate columns as an index. This enables cleaner code when taking subsets (as well as providing more efficient lookup under some circumstances).

In this chapter, you'll be exploring temperatures, a DataFrame of average temperatures in cities around the world.

In [2]:
file_path = 'https://raw.githubusercontent.com/HarisJafri-xcode/Data-Analyst-in-Python/refs/heads/main/04_Data_Manipulation_with_pandas/temperatures.csv'
temperatures = pd.read_csv(file_path)

Let us observe the DataFrame.

In [3]:
temperatures.head()

       date     city        country  avg_temp_c
0  1/1/2000  Abidjan  Côte D'Ivoire      27.293
1  2/1/2000  Abidjan  Côte D'Ivoire      27.685
2  3/1/2000  Abidjan  Côte D'Ivoire      29.061
3  4/1/2000  Abidjan  Côte D'Ivoire      28.162
4  5/1/2000  Abidjan  Côte D'Ivoire      27.547

In [4]:
temperatures.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16500 entries, 0 to 16499
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        16500 non-null  object
 1   city        16500 non-null  object
 2   country     16500 non-null  object
 3   avg_temp_c  16407 non-null  float64
dtypes: float64(1), object(3)
memory usage: 515.8+ KB

In [5]:
temperatures['date'] = pd.to_datetime(temperatures['date'],format='%d/%m/%Y')

Set the index of temperatures to "city", assigning to temperatures_ind.

In [6]:
temperatures_ind = temperatures.set_index('city')
temperatures_ind.head()

              date        country  avg_temp_c
city
Abidjan 2000-01-01  Côte D'Ivoire      27.293
Abidjan 2000-01-02  Côte D'Ivoire      27.685
Abidjan 2000-01-03  Côte D'Ivoire      29.061
Abidjan 2000-01-04  Côte D'Ivoire      28.162
Abidjan 2000-01-05  Côte D'Ivoire      27.547

We can even reset the Index !

In [7]:
temperatures_ind.reset_index() # Not Deleting the Index Columns

          city       date        country  avg_temp_c
0      Abidjan 2000-01-01  Côte D'Ivoire      27.293
1      Abidjan 2000-01-02  Côte D'Ivoire      27.685
2      Abidjan 2000-01-03  Côte D'Ivoire      29.061
3      Abidjan 2000-01-04  Côte D'Ivoire      28.162
4      Abidjan 2000-01-05  Côte D'Ivoire      27.547
...        ...        ...            ...         ...
16495     Xian 2013-01-05          China      18.979
16496     Xian 2013-01-06          China      23.522
16497     Xian 2013-01-07          China      25.251
16498     Xian 2013-01-08          China      24.528
16499     Xian 2013-01-09          China         NaN

[16500 rows x 4 columns]

In [8]:
temperatures_ind.reset_index(drop=True) # Dropping the Index Column

            date        country  avg_temp_c
0     2000-01-01  Côte D'Ivoire      27.293
1     2000-01-02  Côte D'Ivoire      27.685
2     2000-01-03  Côte D'Ivoire      29.061
3     2000-01-04  Côte D'Ivoire      28.162
4     2000-01-05  Côte D'Ivoire      27.547
...          ...            ...         ...
16495 2013-01-05          China      18.979
16496 2013-01-06          China      23.522
16497 2013-01-07          China      25.251
16498 2013-01-08          China      24.528
16499 2013-01-09          China         NaN

[16500 rows x 3 columns]

# Subsetting with .loc[]

The killer feature for indexes is .loc[]: a subsetting method that accepts index values. When you pass it a single argument, it will take a subset of rows.

The code for subsetting using .loc[] can be easier to read than standard square bracket subsetting, which can make your code less burdensome to maintain.

Create a list called cities that contains "London" and "Paris".

In [9]:
cities = ["London", "Paris"]

Use [] subsetting to filter temperatures for rows where the city column takes a value in the cities list.

In [10]:
temperatures[temperatures['city'].isin(cities)]

            date    city         country  avg_temp_c
8910  2000-01-01  London  United Kingdom       4.693
8911  2000-01-02  London  United Kingdom       6.115
8912  2000-01-03  London  United Kingdom       7.422
8913  2000-01-04  London  United Kingdom       8.246
8914  2000-01-05  London  United Kingdom      12.491
...          ...     ...             ...         ...
12040 2013-01-05   Paris          France      11.703
12041 2013-01-06   Paris          France      16.340
12042 2013-01-07   Paris          France      21.186
12043 2013-01-08   Paris          France      19.235
12044 2013-01-09   Paris          France         NaN

[330 rows x 4 columns]

Use .loc[] subsetting to filter temperatures_ind for rows where the city is in the cities list.

In [11]:
temperatures_ind.loc[["London","Paris"]]

             date         country  avg_temp_c
city
London 2000-01-01  United Kingdom       4.693
London 2000-01-02  United Kingdom       6.115
London 2000-01-03  United Kingdom       7.422
London 2000-01-04  United Kingdom       8.246
London 2000-01-05  United Kingdom      12.491
...           ...             ...         ...
Paris  2013-01-05          France      11.703
Paris  2013-01-06          France      16.340
Paris  2013-01-07          France      21.186
Paris  2013-01-08          France      19.235
Paris  2013-01-09          France         NaN

[330 rows x 3 columns]

# Setting Multi-level Indexes

Indexes can also be made out of multiple columns, forming a multi-level index (sometimes called a hierarchical index). There is a trade-off to using these.

The benefit is that multi-level indexes make it more natural to reason about nested categorical variables. For example, in a clinical trial, you might have control and treatment groups. Then each test subject belongs to one or another group, and we can say that a test subject is nested inside the treatment group. Similarly, in the temperature dataset, the city is located in the country, so we can say a city is nested inside the country.

The main downside is that the code for manipulating indexes is different from the code for manipulating columns, so you have to learn two syntaxes and keep track of how your data is represented.

Set the index of temperatures to the "country" and "city" columns, and assign this to temperatures_ind.

In [12]:
temperatures_ind = temperatures.set_index(['country','city'])

Specify two country/city pairs to keep: "Brazil"/"Rio De Janeiro" and "Pakistan"/"Lahore", assigning to rows_to_keep.

In [13]:
rows_to_keep = [('Brazil','Rio De Janeiro'),('Pakistan','Lahore')]

In [14]:
temperatures_ind.loc[rows_to_keep]

                              date  avg_temp_c
country  city
Brazil   Rio De Janeiro 2000-01-01      25.974
         Rio De Janeiro 2000-01-02      26.699
         Rio De Janeiro 2000-01-03      26.270
         Rio De Janeiro 2000-01-04      25.750
         Rio De Janeiro 2000-01-05      24.356
...                            ...         ...
Pakistan Lahore         2013-01-05      33.457
         Lahore         2013-01-06      34.456
         Lahore         2013-01-07      33.279
         Lahore         2013-01-08      31.511
         Lahore         2013-01-09         NaN

[330 rows x 2 columns]

# Sorting by index values

Previously, you changed the order of the rows in a DataFrame by calling .sort_values(). It's also useful to be able to sort by elements in the index. For this, you need to use .sort_index().

Sort temperatures_ind by the index values.

In [15]:
temperatures_ind.sort_index()

                         date  avg_temp_c
country     city
Afghanistan Kabul  2000-01-01       3.326
            Kabul  2000-01-02       3.454
            Kabul  2000-01-03       9.612
            Kabul  2000-01-04      17.925
            Kabul  2000-01-05      24.658
...                       ...         ...
Zimbabwe    Harare 2013-01-05      18.298
            Harare 2013-01-06      17.020
            Harare 2013-01-07      16.299
            Harare 2013-01-08      19.232
            Harare 2013-01-09         NaN

[16500 rows x 2 columns]

Sort temperatures_ind by the index values at the "city" level.

In [16]:
temperatures_ind.sort_index(level='city')

                            date  avg_temp_c
country       city
Côte D'Ivoire Abidjan 2000-01-01      27.293
              Abidjan 2000-01-02      27.685
              Abidjan 2000-01-03      29.061
              Abidjan 2000-01-04      28.162
              Abidjan 2000-01-05      27.547
...                          ...         ...
China         Xian    2013-01-05      18.979
              Xian    2013-01-06      23.522
              Xian    2013-01-07      25.251
              Xian    2013-01-08      24.528
              Xian    2013-01-09         NaN

[16500 rows x 2 columns]

Sort temperatures_ind by ascending country then descending city.

In [17]:
temperatures_ind.sort_index(level=['country','city'], ascending=[True,False])

                         date  avg_temp_c
country     city
Afghanistan Kabul  2000-01-01       3.326
            Kabul  2000-01-02       3.454
            Kabul  2000-01-03       9.612
            Kabul  2000-01-04      17.925
            Kabul  2000-01-05      24.658
...                       ...         ...
Zimbabwe    Harare 2013-01-05      18.298
            Harare 2013-01-06      17.020
            Harare 2013-01-07      16.299
            Harare 2013-01-08      19.232
            Harare 2013-01-09         NaN

[16500 rows x 2 columns]

# Slicing Index Values

Slicing lets you select consecutive elements of an object using first:last syntax. DataFrames can be sliced by index values or by row/column number; we'll start with the first case. This involves slicing inside the .loc[] method.

Compared to slicing lists, there are a few things to remember.

- You can only slice an index if the index is sorted (using .sort_index()).
- To slice at the outer level, first and last can be strings.
- To slice at inner levels, first and last should be tuples.
- If you pass a single slice to .loc[], it will slice the rows.

Sort the index of temperatures_ind and store in temperatures_srt

In [18]:
temperatures_srt = temperatures_ind.sort_index()

Use slicing with .loc[] to get these subsets:
- from Pakistan to Philippines.
- from Lahore to Manila. (This will return nonsense.)
- from Pakistan, Lahore to Philippines, Manila.

In [19]:
temperatures_srt.loc['Pakistan':'Philippines']

                             date  avg_temp_c
country     city
Pakistan    Faisalabad 2000-01-01      12.792
            Faisalabad 2000-01-02      14.339
            Faisalabad 2000-01-03      20.309
            Faisalabad 2000-01-04      29.072
            Faisalabad 2000-01-05      34.845
...                           ...         ...
Philippines Manila     2013-01-05      29.552
            Manila     2013-01-06      28.572
            Manila     2013-01-07      27.266
            Manila     2013-01-08      26.754
            Manila     2013-01-09         NaN

[825 rows x 2 columns]

In [20]:
# temperatures_srt.loc['Lahore','Manila'] # This shall return an Error

In [21]:
temperatures_srt.loc[('Pakistan, Lahore'):('Philippines, Manila')]

                         date  avg_temp_c
country     city
Peru        Lima   2000-01-01      19.455
            Lima   2000-01-02      20.911
            Lima   2000-01-03      20.113
            Lima   2000-01-04      18.726
            Lima   2000-01-05      16.710
...                       ...         ...
Philippines Manila 2013-01-05      29.552
            Manila 2013-01-06      28.572
            Manila 2013-01-07      27.266
            Manila 2013-01-08      26.754
            Manila 2013-01-09         NaN

[330 rows x 2 columns]

# Slicing in Both Directions

You've seen slicing DataFrames by rows and by columns, but since DataFrames are two-dimensional objects, it is often natural to slice both dimensions at once. That is, by passing two arguments to .loc[], you can subset by rows and columns in one go.

Use .loc[] slicing to subset rows from India, Hyderabad to Iraq, Baghdad.

In [22]:
temperatures_srt.loc[('India','Hyderabad'):('Iraq','Baghdad')]

                        date  avg_temp_c
country city
India   Hyderabad 2000-01-01      23.779
        Hyderabad 2000-01-02      25.826
        Hyderabad 2000-01-03      28.821
        Hyderabad 2000-01-04      32.698
        Hyderabad 2000-01-05      32.438
...                      ...         ...
Iraq    Baghdad   2013-01-05      28.673
        Baghdad   2013-01-06      33.803
        Baghdad   2013-01-07      36.392
        Baghdad   2013-01-08      35.463
        Baghdad   2013-01-09         NaN

[2145 rows x 2 columns]

Use .loc[] slicing to subset columns from date to avg_temp_c.

In [23]:
temperatures_srt.loc[:,'date':'avg_temp_c']

                         date  avg_temp_c
country     city
Afghanistan Kabul  2000-01-01       3.326
            Kabul  2000-01-02       3.454
            Kabul  2000-01-03       9.612
            Kabul  2000-01-04      17.925
            Kabul  2000-01-05      24.658
...                       ...         ...
Zimbabwe    Harare 2013-01-05      18.298
            Harare 2013-01-06      17.020
            Harare 2013-01-07      16.299
            Harare 2013-01-08      19.232
            Harare 2013-01-09         NaN

[16500 rows x 2 columns]

Slice in both directions at once from Hyderabad to Baghdad, and date to avg_temp_c.

In [24]:
temperatures_srt.loc[('India','Hyderabad'):('Iraq','Baghdad'),'date':'avg_temp_c']

                        date  avg_temp_c
country city
India   Hyderabad 2000-01-01      23.779
        Hyderabad 2000-01-02      25.826
        Hyderabad 2000-01-03      28.821
        Hyderabad 2000-01-04      32.698
        Hyderabad 2000-01-05      32.438
...                      ...         ...
Iraq    Baghdad   2013-01-05      28.673
        Baghdad   2013-01-06      33.803
        Baghdad   2013-01-07      36.392
        Baghdad   2013-01-08      35.463
        Baghdad   2013-01-09         NaN

[2145 rows x 2 columns]

# Slicing Time Series

Slicing is particularly useful for time series since it's a common thing to want to filter for data within a date range. Add the date column to the index, then use .loc[] to perform the subsetting. The important thing to remember is to keep your dates in ISO 8601 format, that is, "yyyy-mm-dd" for year-month-day, "yyyy-mm" for year-month, and "yyyy" for year.

Use Boolean conditions, not .isin() or .loc[], and the full date "yyyy-mm-dd", to subset temperatures for rows where the date column is in 2010 and 2011 and print the results.

In [25]:
temperatures_bool = temperatures[(temperatures['date'] >= '2010-01-01') & (temperatures['date'] <= '2011-12-30')]

In [26]:
temperatures_bool

            date     city        country  avg_temp_c
120   2010-01-01  Abidjan  Côte D'Ivoire      28.270
121   2010-01-02  Abidjan  Côte D'Ivoire      29.262
122   2010-01-03  Abidjan  Côte D'Ivoire      29.596
123   2010-01-04  Abidjan  Côte D'Ivoire      29.068
124   2010-01-05  Abidjan  Côte D'Ivoire      28.258
...          ...      ...            ...         ...
16474 2011-01-08     Xian          China      23.069
16475 2011-01-09     Xian          China      16.775
16476 2011-01-10     Xian          China      12.587
16477 2011-01-11     Xian          China       7.543
16478 2011-01-12     Xian          China      -0.490

[2400 rows x 4 columns]

Set the index of temperatures to the date column and sort it.

In [27]:
temperatures_ind = temperatures.set_index('date').sort_index()

In [28]:
temperatures_ind

                 city        country  avg_temp_c
date
2000-01-01    Abidjan  Côte D'Ivoire      27.293
2000-01-01     Lahore       Pakistan      12.792
2000-01-01   Tangshan          China      -5.406
2000-01-01      Gizeh          Egypt      12.669
2000-01-01    Lakhnau          India      15.152
...               ...            ...         ...
2013-01-09    Nanjing          China         NaN
2013-01-09  New Delhi          India         NaN
2013-01-09   New York  United States      17.408
2013-01-09     Peking          China         NaN
2013-01-09       Xian          China         NaN

[16500 rows x 3 columns]

Use .loc[] to subset temperatures_ind for rows in 2010 and 2011.

In [29]:
temperatures_ind.loc['2010':'2011']

                  city    country  avg_temp_c
date
2010-01-01  Faisalabad   Pakistan      11.810
2010-01-01   Melbourne  Australia      20.016
2010-01-01   Chongqing      China       7.921
2010-01-01   São Paulo     Brazil      23.738
2010-01-01   Guangzhou      China      14.136
...                ...        ...         ...
2011-01-12      Nagoya      Japan       6.476
2011-01-12   Hyderabad      India      23.613
2011-01-12        Cali   Colombia      21.559
2011-01-12        Lima       Peru      18.293
2011-01-12     Bangkok   Thailand      25.021

[2400 rows x 3 columns]

# Subsetting by row/column number

The most common ways to subset rows are the ways we've previously discussed: using a Boolean condition or by index labels. However, it is also occasionally useful to pass row numbers.

This is done using .iloc[], and like .loc[], it can take two arguments to let you subset by rows and columns.

Use .iloc[] on temperatures to take subsets.

In [30]:
# Get 23rd row, 2nd column (index 22, 1)
temperatures.iloc[22,1]

'Abidjan'

In [31]:
# Use slicing to get the first 5 rows
temperatures.iloc[:5]

        date     city        country  avg_temp_c
0 2000-01-01  Abidjan  Côte D'Ivoire      27.293
1 2000-01-02  Abidjan  Côte D'Ivoire      27.685
2 2000-01-03  Abidjan  Côte D'Ivoire      29.061
3 2000-01-04  Abidjan  Côte D'Ivoire      28.162
4 2000-01-05  Abidjan  Côte D'Ivoire      27.547

In [32]:
# Use slicing to get columns 3 to 4
temperatures.iloc[:,2:4]

             country  avg_temp_c
0      Côte D'Ivoire      27.293
1      Côte D'Ivoire      27.685
2      Côte D'Ivoire      29.061
3      Côte D'Ivoire      28.162
4      Côte D'Ivoire      27.547
...              ...         ...
16495          China      18.979
16496          China      23.522
16497          China      25.251
16498          China      24.528
16499          China         NaN

[16500 rows x 2 columns]

In [33]:
# Use slicing in both directions at once
temperatures.iloc[:6,2:4]

         country  avg_temp_c
0  Côte D'Ivoire      27.293
1  Côte D'Ivoire      27.685
2  Côte D'Ivoire      29.061
3  Côte D'Ivoire      28.162
4  Côte D'Ivoire      27.547
5  Côte D'Ivoire      25.812

# Pivot Temperature by City and Year

It's interesting to see how temperatures for each city change over time—looking at every month results in a big table, which can be tricky to reason about. Instead, let's look at how temperatures change by year.

You can access the components of a date (year, month and day) using code of the form dataframe["column"].dt.component. For example, the month component is dataframe["column"].dt.month, and the year component is dataframe["column"].dt.year.

Once you have the year column, you can create a pivot table with the data aggregated by city and year.

Add a year column to temperatures, from the year component of the date column.

In [34]:
temperatures['year'] = temperatures['date'].dt.year

In [35]:
temperatures.head()

        date     city        country  avg_temp_c  year
0 2000-01-01  Abidjan  Côte D'Ivoire      27.293  2000
1 2000-01-02  Abidjan  Côte D'Ivoire      27.685  2000
2 2000-01-03  Abidjan  Côte D'Ivoire      29.061  2000
3 2000-01-04  Abidjan  Côte D'Ivoire      28.162  2000
4 2000-01-05  Abidjan  Côte D'Ivoire      27.547  2000

Make a pivot table of the avg_temp_c column, with country and city as rows, and year as columns. Assign to temp_by_country_city_vs_year, and look at the result.

In [36]:
temp_by_country_city_vs_year = temperatures.pivot_table("avg_temp_c",index=['country','city'],columns='year')

In [39]:
temp_by_country_city_vs_year.head()

year                        2000       2001       2002       2003       2004  \
country     city
Afghanistan Kabul      15.822667  15.847917  15.714583  15.132583  16.128417
Angola      Luanda     24.410333  24.427083  24.790917  24.867167  24.216167
Australia   Melbourne  14.320083  14.180000  14.075833  13.985583  13.742083
            Sydney     17.567417  17.854500  17.733833  17.592333  17.869667
Bangladesh  Dhaka      25.905250  25.931250  26.095000  25.927417  26.136083

year                        2005       2006       2007       2008       2009  \
country     city
Afghanistan Kabul      14.847500  15.798500  15.518000  15.479250  15.093333
Angola      Luanda     24.414583  24.138417  24.241583  24.266333  24.325083
Australia   Melbourne  14.378500  13.991083  14.991833  14.110583  14.647417
            Sydney     18.028083  17.749500  18.020833  17.321083  18.175833
Bangladesh  Dhaka      26.193333  26.440417  25.951333  26.004500  26.535583

year                        2010       2011       2012       2013
country     city
Afghanistan Kabul      15.676000  15.812167  14.510333  16.206125
Angola      Luanda     24.440250  24.150750  24.240083  24.553875
Australia   Melbourne  14.231667  14.190917  14.268667  14.741500
            Sydney     17.999000  17.713333  17.474333  18.089750
Bangladesh  Dhaka      26.648167  25.803250  26.283583  26.587000

# Subsetting pivot Tables

A pivot table is just a DataFrame with sorted indexes, so the techniques you have learned already can be used to subset them. In particular, the .loc[] + slicing combination is often helpful.

Use .loc[] on temp_by_country_city_vs_year to take subsets.

From Egypt to India.

In [49]:
temp_by_country_city_vs_year.loc["Egypt":"India",:]

year                       2000       2001       2002       2003       2004  \
country  city
Egypt    Alexandria   20.744500  21.454583  21.456167  21.221417  21.064167
         Cairo        21.486167  22.330833  22.414083  22.170500  22.081917
         Gizeh        21.486167  22.330833  22.414083  22.170500  22.081917
Ethiopia Addis Abeba  18.241250  18.296417  18.469750  18.320917  18.292750
France   Paris        11.739667  11.371250  11.871333  11.909500  11.338833
Germany  Berlin       10.963667   9.690250  10.264417  10.065750   9.822583
India    Ahmadabad    27.436000  27.198083  27.719083  27.403833  27.628333
         Bangalore    25.337917  25.528167  25.755333  25.924750  25.252083
         Bombay       27.203667  27.243667  27.628667  27.578417  27.318750
         Calcutta     26.491333  26.515167  26.703917  26.561333  26.634333
         Delhi        26.048333  25.862917  26.634333  25.721083  26.239917
         Hyderabad    27.231833  27.555167  27.665167  27.844583  27.228500
         Jaipur       26.430250  26.023000  27.031667  26.027417  26.642167
         Kanpur       25.353917  25.326500  26.116833  25.409083  25.586500
         Lakhnau      25.353917  25.326500  26.116833  25.409083  25.586500
         Madras       28.811667  29.162917  29.246500  29.273083  28.810917
         Nagpur       26.181417  26.321667  26.753000  26.503833  26.406333
         New Delhi    26.048333  25.862917  26.634333  25.721083  26.239917
         Pune         25.110917  25.337833  25.583000  25.748417  25.316167
         Surat        27.029000  26.897250  27.347750  27.230917  27.290583

year                       2005       2006       2007       2008       2009  \
country  city
Egypt    Alexandria   21.082333  21.148167  21.507750  21.739000  21.670500
         Cairo        22.006500  22.050000  22.361000  22.644500  22.625000
         Gizeh        22.006500  22.050000  22.361000  22.644500  22.625000
Ethiopia Addis Abeba  18.312833  18.427083  18.142583  18.165000  18.765333
France   Paris        11.552917  11.788500  11.750833  11.278250  11.464083
Germany  Berlin        9.919083  10.545333  10.883167  10.657750  10.062500
India    Ahmadabad    26.828083  27.282833  27.511167  27.048500  28.095833
         Bangalore    25.476500  25.418250  25.464333  25.352583  25.725750
         Bombay       27.035750  27.381500  27.634667  27.177750  27.844500
         Calcutta     26.729167  26.986250  26.584583  26.522333  27.153250
         Delhi        25.716083  26.365917  26.145667  25.675000  26.554250
         Hyderabad    27.488833  27.471000  27.545333  27.446667  28.026500
         Jaipur       25.772250  26.429833  26.267000  25.877583  26.919500
         Kanpur       25.621500  25.848833  25.436083  25.109750  25.987083
         Lakhnau      25.621500  25.848833  25.436083  25.109750  25.987083
         Madras       29.099417  29.073250  28.970167  29.024083  29.417417
         Nagpur       26.229167  26.374833  26.393667  26.188000  27.138917
         New Delhi    25.716083  26.365917  26.145667  25.675000  26.554250
         Pune         25.085583  25.310167  25.584833  25.230250  25.868250
         Surat        26.724500  27.149417  27.311750  26.828750  27.819833

year                       2010       2011       2012       2013
country  city
Egypt    Alexandria   22.459583  21.181500  21.552583  21.438500
         Cairo        23.718250  21.986917  22.484250  22.907000
         Gizeh        23.718250  21.986917  22.484250  22.907000
Ethiopia Addis Abeba  18.298250  18.606750  18.448583  19.539000
France   Paris        10.409833  12.325750  11.219917  11.011625
Germany  Berlin        8.606833  10.556417   9.964333  10.121500
India    Ahmadabad    28.017833  27.290417  27.027250  27.608625
         Bangalore    25.705250  25.362083  26.042333  26.610500
         Bombay       27.765417  27.384917  27.192500  26.713000
         Calcutta     27.288833  26.406917  26.935083  27.369250
         Delhi        26.520250  25.629500  25.889417  26.709250
         Hyderabad    27.693417  27.408833  28.018583  28.851250
         Jaipur       26.818417  25.916500  25.884500  26.844125
         Kanpur       26.021750  25.062083  25.445417  26.121250
         Lakhnau      26.021750  25.062083  25.445417  26.121250
         Madras       29.047333  29.063167  29.778417  30.411750
         Nagpur       26.927000  26.004667  26.327917  27.112375
         New Delhi    26.520250  25.629500  25.889417  26.709250
         Pune         25.749167  25.161417  25.296833  25.847625
         Surat        27.681667  27.016583  26.889250  27.437750

From Egypt, Cairo to India, Delhi.

In [53]:
temp_by_country_city_vs_year.loc[("Egypt","Cairo"):("India","Delhi"),:]

year                       2000       2001       2002       2003       2004  \
country  city
Egypt    Cairo        21.486167  22.330833  22.414083  22.170500  22.081917
         Gizeh        21.486167  22.330833  22.414083  22.170500  22.081917
Ethiopia Addis Abeba  18.241250  18.296417  18.469750  18.320917  18.292750
France   Paris        11.739667  11.371250  11.871333  11.909500  11.338833
Germany  Berlin       10.963667   9.690250  10.264417  10.065750   9.822583
India    Ahmadabad    27.436000  27.198083  27.719083  27.403833  27.628333
         Bangalore    25.337917  25.528167  25.755333  25.924750  25.252083
         Bombay       27.203667  27.243667  27.628667  27.578417  27.318750
         Calcutta     26.491333  26.515167  26.703917  26.561333  26.634333
         Delhi        26.048333  25.862917  26.634333  25.721083  26.239917

year                       2005       2006       2007       2008       2009  \
country  city
Egypt    Cairo        22.006500  22.050000  22.361000  22.644500  22.625000
         Gizeh        22.006500  22.050000  22.361000  22.644500  22.625000
Ethiopia Addis Abeba  18.312833  18.427083  18.142583  18.165000  18.765333
France   Paris        11.552917  11.788500  11.750833  11.278250  11.464083
Germany  Berlin        9.919083  10.545333  10.883167  10.657750  10.062500
India    Ahmadabad    26.828083  27.282833  27.511167  27.048500  28.095833
         Bangalore    25.476500  25.418250  25.464333  25.352583  25.725750
         Bombay       27.035750  27.381500  27.634667  27.177750  27.844500
         Calcutta     26.729167  26.986250  26.584583  26.522333  27.153250
         Delhi        25.716083  26.365917  26.145667  25.675000  26.554250

year                       2010       2011       2012       2013
country  city
Egypt    Cairo        23.718250  21.986917  22.484250  22.907000
         Gizeh        23.718250  21.986917  22.484250  22.907000
Ethiopia Addis Abeba  18.298250  18.606750  18.448583  19.539000
France   Paris        10.409833  12.325750  11.219917  11.011625
Germany  Berlin        8.606833  10.556417   9.964333  10.121500
India    Ahmadabad    28.017833  27.290417  27.027250  27.608625
         Bangalore    25.705250  25.362083  26.042333  26.610500
         Bombay       27.765417  27.384917  27.192500  26.713000
         Calcutta     27.288833  26.406917  26.935083  27.369250
         Delhi        26.520250  25.629500  25.889417  26.709250

From Egypt, Cairo to India, Delhi, and 2005 to 2010.

In [54]:
temp_by_country_city_vs_year.loc[("Egypt","Cairo"):("India","Delhi"),"2005":"2010"]

year                       2005       2006       2007       2008       2009  \
country  city
Egypt    Cairo        22.006500  22.050000  22.361000  22.644500  22.625000
         Gizeh        22.006500  22.050000  22.361000  22.644500  22.625000
Ethiopia Addis Abeba  18.312833  18.427083  18.142583  18.165000  18.765333
France   Paris        11.552917  11.788500  11.750833  11.278250  11.464083
Germany  Berlin        9.919083  10.545333  10.883167  10.657750  10.062500
India    Ahmadabad    26.828083  27.282833  27.511167  27.048500  28.095833
         Bangalore    25.476500  25.418250  25.464333  25.352583  25.725750
         Bombay       27.035750  27.381500  27.634667  27.177750  27.844500
         Calcutta     26.729167  26.986250  26.584583  26.522333  27.153250
         Delhi        25.716083  26.365917  26.145667  25.675000  26.554250

year                       2010
country  city
Egypt    Cairo        23.718250
         Gizeh        23.718250
Ethiopia Addis Abeba  18.298250
France   Paris        10.409833
Germany  Berlin        8.606833
India    Ahmadabad    28.017833
         Bangalore    25.705250
         Bombay       27.765417
         Calcutta     27.288833
         Delhi        26.520250

# Calculating on a pivot table

Pivot tables are filled with summary statistics, but they are only a first step to finding something insightful. Often you'll need to perform further calculations on them. A common thing to do is to find the rows or columns where the highest or lowest value occurs.

Recall from Chapter 1 that you can easily subset a Series or DataFrame to find rows of interest using a logical condition inside of square brackets. For example: series[series > value].

Calculate the mean temperature for each year, assigning to mean_temp_by_year.

In [56]:
mean_temp_by_year = temp_by_country_city_vs_year.mean()
mean_temp_by_year

year
2000    19.506243
2001    19.679352
2002    19.855685
2003    19.630197
2004    19.672204
2005    19.607239
2006    19.793993
2007    19.854270
2008    19.608778
2009    19.833752
2010    19.911734
2011    19.549197
2012    19.668239
2013    20.312285
dtype: float64

Filter mean_temp_by_year for the year that had the highest mean temperature.

In [68]:
mean_temp_by_year[mean_temp_by_year == mean_temp_by_year.max()]

year
2013    20.312285
dtype: float64

Calculate the mean temperature for each city (across columns), assigning to mean_temp_by_city.

In [70]:
mean_temp_by_city = temp_by_country_city_vs_year.mean(axis="columns")

Filter mean_temp_by_city for the city that had the lowest mean temperature.

In [71]:
mean_temp_by_city[mean_temp_by_city == mean_temp_by_city.min()]

country  city
China    Harbin    4.876551
dtype: float64